       IDENTIFICATION DIVISION.
       PROGRAM-ID. PXXQA42A.
       9100-TRATA-ERRO-FICH.
      *
           IF SW-DEBUG-SIM
              MOVE '9100-TRATA-ERRO-FICH'   TO WS-MSG-PAR
              DISPLAY WS-MSG
           END-IF
      *
           PERFORM 8100-DATA-HORA-FIM
              THRU 8199-DATA-HORA-FIM-EXIT

           MOVE CON-PROGRAMA             TO BHTW0030-NM-PROGRAMA
           MOVE WS-DATA-INI              TO BHTW0030-Z-INIC-EXE-PRG
           MOVE WS-DATA-FIM              TO BHTW0030-Z-ERRO
           MOVE WS-HORA-INI              TO BHTW0030-H-INIC-EXE-PRG
           MOVE WS-HORA-FIM              TO BHTW0030-H-ERRO

           SET  BHTW0030-ABEND-FICHEIRO  TO TRUE

           PERFORM BHOP0013-FIM-ESTATISTICA
              THRU BHOP0013-FIM-ESTATISTICA-EXIT

           PERFORM BHTP0030-DISPLAY-ERRO
              THRU BHTP0030-DISPLAY-ERRO-EXIT

           PERFORM 9900-ABEND
              THRU 9999-ABEND-EXIT.
      *
       9199-TRATA-ERRO-FICH-EXIT.
           EXIT.
